---
kind: property
id: P:Autodesk.Revit.DB.RenderingImageExposureSettings.Shadows
source: html/acf175b2-531e-9a10-4e8e-2a30973d2c3d.htm
---
# Autodesk.Revit.DB.RenderingImageExposureSettings.Shadows Property

The shadows value.

## Syntax (C#)
```csharp
public double Shadows { get; set; }
```

## Remarks
Increase this value to get darker shadows.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The value of shadows is not valid. The valid range is 0.1 to 4.